//=============================================================================
//
// read.h
// Author : koduna hirohito
//
//=============================================================================
#ifndef _READ_H_			//このマクロ定義がされなかったら
#define _READ_H_			//2重インクルード防止のマクロ定義

//*****************************************************************************
// インクルード
//*****************************************************************************
#include "main.h"
#include "ranking.h"

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CRead
{
	static const int LINE_MAX_READING_LENGTH = 256;
public:

	CRead();
	~CRead();
	void ReadRanking(float *pRanking);
	void SaveRanking(const float *pRanking);

private:
	
};

#endif